In [1]:
# navigate to the Features folder
import sys
sys.path.append(sys.path[0]+'/./Features')

# universal import
from universal_imports import *

#------------------------------
# Features import

import helper
import grader

#------------------------------

## Finding A Standard Format for the Main Dataframe

In [2]:
main_df = pd.read_csv("Data/Users/trann/English Number.csv", header = None)
main_df

       0  1
0    one  1
1    two  2
2  three  3

In [8]:
main_df.rename(columns = {0: "Word", 1: "Definition"}, inplace = True)
main_df

     one  1  Mastery  Total Tries  Total Success
0    two  2        0            0              0
1  three  3        0            0              0

In [3]:
helper.reformat_set_df("Data/Users/trann/English Number.csv")

main_df = pd.read_csv("Data/Users/trann/English Number.csv")

main_df

TypeError: 'NoneType' object does not support item assignment

     one  1  Mastery  Total Tries  Total Success
0    two  2        0            0              0
1  three  3        0            0              0

In [16]:
main_df = pd.read_csv("Data/Users/trann/French Food.csv", header = None)

# get the number of columns of the dataframe
num_cols = len(main_df.columns)

num_cols

2

In [24]:
main_df = pd.read_csv("Data/Users/trann/English Number.csv", header = None)

# rename column 0 to "Word"
main_df.rename(columns = {0: "Word"}, inplace = True)

# rename column 1 to "Definition"
main_df.rename(columns = {1: "Definition"}, inplace = True)

# add column "Mastery" with all values as 0
main_df["Mastery"] = 0

# add column "Total Tries"
main_df["Total Tries"] = 0

# add column "Total Success"
main_df["Total Success"] = 0

main_df

# export
main_df.to_csv("Data/Users/trann/English Number.csv", index = False)

In [18]:
main_df.at[10, "Word"]

'un chou-fleur'

In [22]:
k = [1,2,3]
e = random.shuffle(k)
k

[1, 3, 2]

In [10]:
main_df.head()

,Date,Description,Original Description,Amount,Category,Account Name,Asset
0,2023-01-19,DISCOVER,DISCOVER,-70.01,Credit Card Payment,CHECKING Account,NaN
1,2023-01-19,Payment Thank You-Mobile,Payment Thank You-Mobile,4.99,Credit Card Payment,CREDIT CARD,NaN
2,2023-01-19,Payment Thank You-Mobile,Payment Thank You-Mobile,180.54,Credit Card Payment,CREDIT CARD,NaN
3,2023-01-19,McDonald's Lunch,DOORDASH*MCDONALDS,-16.19,Food Delivery,DISCOVER IT CARD,NaN
4,2023-01-18,INTERNET PAYMENT - THANK YOU,INTERNET PAYMENT - THANK YOU,70.01,Credit Card Payment,DISCOVER IT CARD,NaN

In [11]:
# export the processed version
main_df.to_csv('Data/mint_processed.csv', index=False)

In [12]:
main_df.dtypes

Date                    datetime64[ns]
Description                     object
Original Description            object
Amount                         float64
Category                        object
Account Name                    object
Asset                          float64
dtype: object

## Break Down Monthly Expenses